{
  "hash": "11ec8cbd2fd6",
  "text": "SECTION II\nLIVELIHOODS, ECONOMIES AND SOCIETIES\nReprint 2025-26\n\n\nReprint 2025-26\n\n\n53\nThe  Making  of  a  Global  World\n1  The Pre-modern World\nWhen we talk of ‘globalisation’ we often refer to an economic\nsystem that has emerged since the last 50 years or so. But as you will\nsee in this chapter, the making of the global world has a long\nhistory – of trade, of migration, of people in search of work, the\nmovement of capital, and much else. As we think about the dramatic\nand visible signs of global interconnectedness in our lives today,\nwe need to understand the phases through which this world in\nwhich we live has emerged.\nAll through history, human societies have become steadily more\ninterlinked. From ancient times, travellers, traders, priests and\npilgrims travelled vast distances for knowledge, opportunity and\nspiritual fulfilment, or to escape persecution. They carried goods,\nmoney, values, skills, ideas, inventions, and even germs and diseases.\nAs early as 3000 BCE an active coasta",
  "subject": "language",
  "flashcards": [
    {
      "front": "What were the Silk Routes and why are they considered an example of vibrant pre-modern trade?",
      "back": "The Silk Routes were ancient trade networks that connected the East and West. They facilitated the exchange of goods, culture, and ideas, making them a vibrant example of pre-modern trade.",
      "subject": "language",
      "difficulty": "intermediate"
    },
    {
      "front": "How did the introduction of new foods like spaghetti and potatoes influence global trade?",
      "back": "Foods like spaghetti and potatoes, which traveled across continents, exemplify the global exchange of agricultural products, highlighting how cultural exchanges influenced global trade patterns.",
      "subject": "language",
      "difficulty": "intermediate"
    },
    {
      "front": "Explain how diseases such as smallpox impacted indigenous populations during colonization.",
      "back": "Diseases like smallpox, to which indigenous populations had no immunity, devastated local communities, significantly altering social structures and aiding colonial conquests.",
      "subject": "language",
      "difficulty": "intermediate"
    },
    {
      "front": "In what ways did the invention of the telegraph and advancements in transportation impact trade in the 19th century?",
      "back": "The telegraph enabled faster communication, while advancements in transportation, such as railways, facilitated quicker and more efficient movement of goods, significantly boosting trade.",
      "subject": "language",
      "difficulty": "intermediate"
    },
    {
      "front": "Describe the effects of the cattle plague in Africa during the 1890s on local economies.",
      "back": "The cattle plague in Africa during the 1890s led to the destruction of livestock, which devastated livelihoods and local economies, highlighting the vulnerability of agricultural communities to disease.",
      "subject": "language",
      "difficulty": "intermediate"
    },
    {
      "front": "What did the decline in Indian cotton textiles signify in the context of global trade?",
      "back": "The decline in Indian cotton textiles reflected the shift in global trade dynamics, where industrialization in the West led to increased competition and a decrease in traditional Indian exports.",
      "subject": "language",
      "difficulty": "intermediate"
    },
    {
      "front": "How did agricultural overproduction contribute to economic problems in the 1920s?",
      "back": "Agricultural overproduction led to falling prices and economic distress for farmers, contributing to broader economic instability and setting the stage for the Great Depression.",
      "subject": "language",
      "difficulty": "intermediate"
    },
    {
      "front": "What role did major banks play in the economic collapse during the Great Depression?",
      "back": "Major banks, facing runs and closures, played a central role in the economic collapse during the Great Depression, as their failures led to loss of savings and credit contraction.",
      "subject": "language",
      "difficulty": "intermediate"
    },
    {
      "front": "How did fixed exchange rates, like the Indian rupee pegged to the dollar, affect post-war economies?",
      "back": "Fixed exchange rates provided stability in international trade but could also lead to economic rigidity and imbalances, affecting the competitiveness of national economies.",
      "subject": "language",
      "difficulty": "intermediate"
    },
    {
      "front": "Discuss the transformation of global geography with the rise of countries like India and China in recent decades.",
      "back": "The rise of India and China has transformed global geography by shifting economic power and influence towards Asia, affecting global trade patterns, investment flows, and international relations.",
      "subject": "language",
      "difficulty": "intermediate"
    }
  ],
  "timestamp": 1750516046039,
  "difficulty": "intermediate",
  "focusAreas": "{\"concepts\":true,\"definitions\":true,\"examples\":false,\"procedures\":false}"
}