{
  "hash": "24cb700a9f2a",
  "text": "SECTION II\nLIVELIHOODS, ECONOMIES AND SOCIETIES\nReprint 2025-26\n\n\nReprint 2025-26\n\n\n53\nThe  Making  of  a  Global  World\n1  The Pre-modern World\nWhen we talk of ‘globalisation’ we often refer to an economic\nsystem that has emerged since the last 50 years or so. But as you will\nsee in this chapter, the making of the global world has a long\nhistory – of trade, of migration, of people in search of work, the\nmovement of capital, and much else. As we think about the dramatic\nand visible signs of global interconnectedness in our lives today,\nwe need to understand the phases through which this world in\nwhich we live has emerged.\nAll through history, human societies have become steadily more\ninterlinked. From ancient times, travellers, traders, priests and\npilgrims travelled vast distances for knowledge, opportunity and\nspiritual fulfilment, or to escape persecution. They carried goods,\nmoney, values, skills, ideas, inventions, and even germs and diseases.\nAs early as 3000 BCE an active coasta",
  "subject": "general",
  "flashcards": [
    {
      "front": "What were the silk routes and why are they significant?",
      "back": "The silk routes were a network of trade paths that connected the East and West, facilitating the exchange of goods, culture, and ideas. They are significant for their role in pre-modern trade and cultural exchanges.",
      "subject": "general",
      "difficulty": "intermediate"
    },
    {
      "front": "How did food serve as an example of long-distance cultural exchange?",
      "back": "Foods like spaghetti and potatoes exemplify long-distance cultural exchange, as they traveled across continents, becoming staples in various countries and showcasing the interconnectedness of different cultures.",
      "subject": "general",
      "difficulty": "intermediate"
    },
    {
      "front": "What role did diseases such as smallpox play during colonization?",
      "back": "Diseases like smallpox were devastating to native populations during colonization, as the indigenous people had no immunity. This gave colonizers an unintentional advantage in conquering and controlling these populations.",
      "subject": "general",
      "difficulty": "intermediate"
    },
    {
      "front": "What was the impact of technological advancements like the telegraph in trade?",
      "back": "The telegraph revolutionized communication, enabling faster and more efficient trade by allowing immediate communication over long distances, which was essential for coordinating commercial activities.",
      "subject": "general",
      "difficulty": "intermediate"
    },
    {
      "front": "How did colonization influence economic and political changes?",
      "back": "Colonization stimulated new investments, improvements in transport infrastructure such as railways, and increased economic activities, which often led to the displacement of local populations and changes in local economies.",
      "subject": "general",
      "difficulty": "intermediate"
    },
    {
      "front": "What was indentured labour migration from India, and where were the main destinations?",
      "back": "Indentured labour migration involved Indian workers being contracted to work in overseas colonies, mainly in the Caribbean islands, under challenging conditions akin to servitude.",
      "subject": "general",
      "difficulty": "intermediate"
    },
    {
      "front": "What was the significance of cities like London in the context of labour migration and trade?",
      "back": "Cities like London were financial centers that played crucial roles in global trade and labour migration by being hubs for financial transactions and attracting labour to meet industrial demands.",
      "subject": "general",
      "difficulty": "intermediate"
    },
    {
      "front": "How did the trade in agricultural products and minerals impact global trade?",
      "back": "Trade in agricultural products like wheat and cotton, along with minerals such as coal, were vital components of global trade, contributing to the prosperity and industrial growth of nations involved.",
      "subject": "general",
      "difficulty": "intermediate"
    },
    {
      "front": "What economic transformation did the US experience in the 1920s?",
      "back": "In the 1920s, the US experienced significant economic growth, characterized by mass production of goods like cars, which rose from 2 million to 5 million, reflecting industrial expansion and consumerism.",
      "subject": "general",
      "difficulty": "intermediate"
    },
    {
      "front": "How did the First World War influence global trade and relations?",
      "back": "The First World War, mainly fought in Europe, disrupted global trade and led to significant geopolitical changes, affecting alliances, economic policies, and the distribution of power among nations.",
      "subject": "general",
      "difficulty": "intermediate"
    }
  ],
  "timestamp": 1750506629140,
  "difficulty": "intermediate",
  "focusAreas": "{\"concepts\":true,\"definitions\":true,\"examples\":false,\"procedures\":false}"
}