{
  "hash": "6ccc652d49dfa58fbe3a4c39e2115286265c45bb58c7052162ae370e0169a112",
  "text": "SECTION II\nLIVELIHOODS, ECONOMIES AND SOCIETIES\nReprint 2025-26\n\n\nReprint 2025-26\n\n\n53\nThe  Making  of  a  Global  World\n1  The Pre-modern World\nWhen we talk of ‘globalisation’ we often refer to an economic\nsystem that has emerged since the last 50 years or so. But as you will\nsee in this chapter, the making of the global world has a long\nhistory – of trade, of migration, of people in search of work, the\nmovement of capital, and much else. As we think about the dramatic\nand visible signs of global interconnectedness in our lives today,\nwe need to understand the phases through which this world in\nwhich we live has emerged.\nAll through history, human societies have become steadily more\ninterlinked. From ancient times, travellers, traders, priests and\npilgrims travelled vast distances for knowledge, opportunity and\nspiritual fulfilment, or to escape persecution. They carried goods,\nmoney, values, skills, ideas, inventions, and even germs and diseases.\nAs early as 3000 BCE an active coasta",
  "subject": "history",
  "flashcards": [
    {
      "front": "What role did germs play in historical military conquests, and how did they differ from conventional weapons?",
      "back": "Germs played a significant role in historical military conquests by decimating indigenous populations who had no immunity to diseases like smallpox. Unlike conventional weapons, which require direct combat, germs could spread rapidly and uncontrollably, often causing more casualties than traditional warfare.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "How did colonization influence political and economic factors in the colonized regions?",
      "back": "Colonization often stimulated economic growth in the colonized regions by integrating them into global trade networks and exploiting their natural resources. Politically, it led to the imposition of foreign governance structures, which altered local power dynamics and often resulted in long-term socio-political impacts.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "Describe the impact of the telegraph on international trade in the 19th century.",
      "back": "The telegraph revolutionized international trade in the 19th century by facilitating instant communication across long distances. This innovation allowed for faster decision-making, improved coordination of trade routes, and enhanced the efficiency of financial transactions across global markets.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "What were some of the major agricultural and mineral products involved in global trade, and how did they contribute to economic development?",
      "back": "Major agricultural products such as wheat and cotton, along with minerals like coal, were central to global trade. These products fueled industrialization and economic development by providing essential raw materials for manufacturing and energy production, thus supporting the growth of capitalist economies.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "How did labor migration affect the economies of countries like Britain during the industrial era?",
      "back": "Labor migration during the industrial era provided a steady supply of workers needed for the rapidly expanding industries in countries like Britain. This influx of labor helped sustain economic growth by filling labor shortages, keeping production costs low, and enabling large-scale industrial operations.",
      "subject": "history",
      "difficulty": "intermediate"
    }
  ],
  "timestamp": 1750460225559,
  "difficulty": "intermediate",
  "focusAreas": "{\"concepts\":true,\"definitions\":true,\"examples\":false,\"procedures\":false}"
}