{
  "hash": "7d3a23533532",
  "text": "SECTION II\nLIVELIHOODS, ECONOMIES AND SOCIETIES\nReprint 2025-26\n\n\nReprint 2025-26\n\n\n53\nThe  Making  of  a  Global  World\n1  The Pre-modern World\nWhen we talk of ‘globalisation’ we often refer to an economic\nsystem that has emerged since the last 50 years or so. But as you will\nsee in this chapter, the making of the global world has a long\nhistory – of trade, of migration, of people in search of work, the\nmovement of capital, and much else. As we think about the dramatic\nand visible signs of global interconnectedness in our lives today,\nwe need to understand the phases through which this world in\nwhich we live has emerged.\nAll through history, human societies have become steadily more\ninterlinked. From ancient times, travellers, traders, priests and\npilgrims travelled vast distances for knowledge, opportunity and\nspiritual fulfilment, or to escape persecution. They carried goods,\nmoney, values, skills, ideas, inventions, and even germs and diseases.\nAs early as 3000 BCE an active coasta",
  "subject": "history",
  "flashcards": [
    {
      "front": "What role did the Silk Routes play in pre-modern trade?",
      "back": "The Silk Routes were a network of trade routes that facilitated the exchange of goods, culture, and ideas between Asia and Europe from as early as the 7th century. They were crucial for the trade of silk, spices, and other commodities and played a significant role in the cultural and economic interactions between different civilizations.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "How did spaghetti and potatoes become common foods in Europe?",
      "back": "Spaghetti was introduced to Sicily in the 5th century, likely due to Arab influences, while potatoes were brought to Europe from the Americas after the Columbian Exchange. Both foods became staples in European diets over time due to their versatility and ability to grow in various climates.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "What were the effects of European conquests in the mid-sixteenth century?",
      "back": "The mid-sixteenth-century European conquests led to the spread of diseases such as smallpox to which indigenous populations had no immunity, causing significant population declines. Additionally, these conquests resulted in the colonization of vast lands, exploitation of resources, and significant cultural and societal changes.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "How did industrial growth in Britain impact the global economy in the 19th century?",
      "back": "Industrial growth in Britain led to increased production and export of manufactured goods, contributing to global trade networks. It also stimulated demand for raw materials from colonies, leading to economic shifts and the development of financial centers like London.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "What role did indentured labor migration play in the 19th-century world economy?",
      "back": "Indentured labor migration in the 19th century involved the movement of workers, often under contracts of indenture, from regions like India and China to plantations in the Caribbean, Africa, and Southeast Asia. This system addressed labor shortages and supported agricultural production in colonies.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "Describe the impact of colonialism on Africa in the late 19th century.",
      "back": "Colonialism in late 19th-century Africa led to the exploitation of natural resources, the imposition of foreign governance, and the displacement of local populations. European powers divided the continent, significantly altering its political and economic landscapes.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "What economic changes occurred in the late 19th century due to the trade in agricultural products?",
      "back": "The late 19th-century trade in agricultural products like wheat and cotton led to the globalization of agriculture, with countries specializing in particular crops. This increased international trade and dependency, impacting local economies and food security.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "How did technological advancements like the telegraph transform the 19th-century world?",
      "back": "Technological advancements such as the telegraph revolutionized communication, enabling faster exchange of information across long distances. This facilitated international trade, coordination of military operations, and global connectivity, profoundly transforming the 19th-century world.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "What were the consequences of the economic depression in the 1930s?",
      "back": "The 1930s economic depression led to widespread unemployment, bank failures, and deflation. It triggered a global economic downturn, affecting industries worldwide and leading to significant changes in economic policies and the rise of welfare states.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "Explain the significance of colonial India's role in the global economy during the 19th century.",
      "back": "Colonial India became a crucial part of the global economy in the 19th century by supplying raw materials like cotton and opium, and serving as a market for British manufactured goods. This integration into the global trade network facilitated economic changes and colonial exploitation.",
      "subject": "history",
      "difficulty": "intermediate"
    }
  ],
  "timestamp": 1750510341849,
  "difficulty": "intermediate",
  "focusAreas": "{\"concepts\":true,\"definitions\":true,\"examples\":false,\"procedures\":false}"
}