{
  "hash": "7d6e66098a6a1b70c3cc1fde20d3be3c67599ccceac74dd78ed88df9ec9fc27f",
  "text": "SECTION II\nLIVELIHOODS, ECONOMIES AND SOCIETIES\nReprint 2025-26\n\n\nReprint 2025-26\n\n\n53\nThe  Making  of  a  Global  World\n1  The Pre-modern World\nWhen we talk of ‘globalisation’ we often refer to an economic\nsystem that has emerged since the last 50 years or so. But as you will\nsee in this chapter, the making of the global world has a long\nhistory – of trade, of migration, of people in search of work, the\nmovement of capital, and much else. As we think about the dramatic\nand visible signs of global interconnectedness in our lives today,\nwe need to understand the phases through which this world in\nwhich we live has emerged.\nAll through history, human societies have become steadily more\ninterlinked. From ancient times, travellers, traders, priests and\npilgrims travelled vast distances for knowledge, opportunity and\nspiritual fulfilment, or to escape persecution. They carried goods,\nmoney, values, skills, ideas, inventions, and even germs and diseases.\nAs early as 3000 BCE an active coasta",
  "subject": "programming",
  "flashcards": [
    {
      "front": "What is the significance of using 'such as' in programming documentation or comments?",
      "back": "In programming documentation or comments, 'such as' is used to provide examples that clarify or illustrate a point. It helps in making the content more understandable by showing specific instances or cases that are relevant to the topic being discussed.",
      "subject": "programming",
      "difficulty": "intermediate"
    },
    {
      "front": "How can concepts like 'labour migration' be related to programming or software development?",
      "back": "In programming, 'labour migration' can be analogous to concepts like outsourcing or remote work, where development teams are distributed across different geographies. This can affect communication, coordination, and cultural integration within software projects.",
      "subject": "programming",
      "difficulty": "intermediate"
    },
    {
      "front": "Why are historical economic factors, such as the collapse of major banks, relevant to understanding software development trends?",
      "back": "Historical economic factors like the collapse of major banks can influence software development trends by affecting investment in technology, changing market demands, and shifting priorities in innovation. Economic downturns may lead to increased focus on cost-efficiency and automation in software solutions.",
      "subject": "programming",
      "difficulty": "intermediate"
    },
    {
      "front": "How do inventions like the telegraph relate to modern programming concepts?",
      "back": "Inventions like the telegraph are precursors to modern communication technologies and have laid the groundwork for concepts such as networking, real-time data transmission, and asynchronous communication in programming. Understanding these concepts is crucial for developing software that relies on data exchange and connectivity.",
      "subject": "programming",
      "difficulty": "intermediate"
    },
    {
      "front": "What role do 'financial centres' play in the tech industry and software development?",
      "back": "Financial centres play a significant role in the tech industry by providing funding, investment opportunities, and economic infrastructure necessary for the growth of tech startups and companies. They influence software development by determining which technologies are prioritized based on economic trends and investment flows.",
      "subject": "programming",
      "difficulty": "intermediate"
    }
  ],
  "timestamp": 1750458660848,
  "difficulty": "intermediate",
  "focusAreas": "{\"concepts\":true,\"definitions\":true,\"examples\":false,\"procedures\":false}"
}