{
  "hash": "8b18447024c7",
  "text": "SECTION II\nLIVELIHOODS, ECONOMIES AND SOCIETIES\nReprint 2025-26\n\n\nReprint 2025-26\n\n\n53\nThe  Making  of  a  Global  World\n1  The Pre-modern World\nWhen we talk of ‘globalisation’ we often refer to an economic\nsystem that has emerged since the last 50 years or so. But as you will\nsee in this chapter, the making of the global world has a long\nhistory – of trade, of migration, of people in search of work, the\nmovement of capital, and much else. As we think about the dramatic\nand visible signs of global interconnectedness in our lives today,\nwe need to understand the phases through which this world in\nwhich we live has emerged.\nAll through history, human societies have become steadily more\ninterlinked. From ancient times, travellers, traders, priests and\npilgrims travelled vast distances for knowledge, opportunity and\nspiritual fulfilment, or to escape persecution. They carried goods,\nmoney, values, skills, ideas, inventions, and even germs and diseases.\nAs early as 3000 BCE an active coasta",
  "subject": "general",
  "flashcards": [
    {
      "front": "What are the Silk Routes and why are they significant?",
      "back": "The Silk Routes were a network of trade paths connecting the East and West, significant for facilitating the exchange of goods, culture, and ideas in pre-modern times.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "How did food exemplify long-distance cultural exchange?",
      "back": "Foods like spaghetti and potatoes traveled great distances, illustrating how culinary practices and ingredients spread across cultures through trade and exploration.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "What role did diseases like smallpox play in colonization?",
      "back": "Diseases such as smallpox, to which colonizers were immune, devastated native populations, aiding colonization by weakening local resistance.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "What types of goods were commonly traded in the 19th century?",
      "back": "In the 19th century, trade often involved agricultural products like wheat and cotton, as well as minerals such as coal.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "What was the impact of technological advancements like the telegraph on trade?",
      "back": "Inventions like the telegraph improved communication, facilitating faster and more efficient trade by enabling quicker decision-making and coordination.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "How did colonization influence global trade and economy?",
      "back": "Colonization spurred investments in infrastructure, like railways, enhancing the movement of goods and boosting economic integration between colonies and colonizers.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "How did indentured labor migration from India affect global labor markets?",
      "back": "Indentured labor migration from India filled labor shortages in places like the Caribbean, significantly impacting local economies and demographics.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "What economic challenges faced the US during the Great Depression?",
      "back": "The US faced agricultural overproduction, bank failures, and high unemployment during the Great Depression, leading to widespread economic hardship.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "How did World War I impact global trade?",
      "back": "World War I disrupted trade routes, caused economic strain, and led to a shift in global power dynamics, affecting international commerce.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "What was a key feature of the US economy in the 1920s?",
      "back": "A key feature was the rise in mass production, notably in the automotive industry, which significantly increased consumer goods availability.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "How did the post-war era aim to rebuild the world economy?",
      "back": "The post-war era focused on stabilizing currencies, reducing unemployment, and promoting international trade to rebuild economies after the war.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "What was the impact of the fixed exchange rate system post-World War II?",
      "back": "The fixed exchange rate system aimed to stabilize global currencies by pegging them to the US dollar, promoting economic stability and international trade.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "What role did India play in global textile trade historically?",
      "back": "India was a major exporter of cotton textiles and indigo dye, significantly contributing to global trade through its vibrant textile industry.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "How did labor migration affect financial centers like London?",
      "back": "Labor migration supplied financial centers with necessary workforce, supporting economic growth and development in such urban areas.",
      "subject": "general",
      "difficulty": "beginner"
    },
    {
      "front": "What lessons were learned from the inter-war economic policies?",
      "back": "Economists and politicians learned the importance of international cooperation and economic stability to prevent financial crises like the Great Depression.",
      "subject": "general",
      "difficulty": "beginner"
    }
  ],
  "timestamp": 1750512515657,
  "difficulty": "beginner",
  "focusAreas": "{\"concepts\":true,\"definitions\":true,\"examples\":false,\"procedures\":false}"
}