{
  "hash": "9418936cf32e",
  "text": "SECTION II\nLIVELIHOODS, ECONOMIES AND SOCIETIES\nReprint 2025-26\n\n\nReprint 2025-26\n\n\n53\nThe  Making  of  a  Global  World\n1  The Pre-modern World\nWhen we talk of ‘globalisation’ we often refer to an economic\nsystem that has emerged since the last 50 years or so. But as you will\nsee in this chapter, the making of the global world has a long\nhistory – of trade, of migration, of people in search of work, the\nmovement of capital, and much else. As we think about the dramatic\nand visible signs of global interconnectedness in our lives today,\nwe need to understand the phases through which this world in\nwhich we live has emerged.\nAll through history, human societies have become steadily more\ninterlinked. From ancient times, travellers, traders, priests and\npilgrims travelled vast distances for knowledge, opportunity and\nspiritual fulfilment, or to escape persecution. They carried goods,\nmoney, values, skills, ideas, inventions, and even germs and diseases.\nAs early as 3000 BCE an active coasta",
  "subject": "history",
  "flashcards": [
    {
      "front": "What were the Silk Routes and why are they significant in pre-modern trade?",
      "back": "The Silk Routes were a network of trade routes that connected the East and West, facilitating the exchange of goods, ideas, and culture. They are significant because they contributed to the vibrant pre-modern trade by allowing the exchange of silk, spices, and other valuable commodities across continents.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "How did the introduction of European germs impact the indigenous populations during colonization?",
      "back": "European germs, such as smallpox, had a devastating effect on indigenous populations during colonization, as the natives had no immunity to these diseases. This led to high mortality rates and significantly weakened the ability of indigenous groups to resist colonization.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "What role did indentured labor migration play in the nineteenth-century world economy?",
      "back": "Indentured labor migration involved the relocation of hundreds of thousands of laborers, primarily from India, to work on plantations in colonies such as the Caribbean and Southeast Asia. This was driven by the demand for cheap labor following the abolition of slavery and was a critical aspect of the global labor movement in the nineteenth century.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "Explain the impact of the nineteenth-century industrial growth in Britain on global trade.",
      "back": "The nineteenth-century industrial growth in Britain led to an increase in manufactured goods, which were exported across the globe. This industrial expansion contributed to Britain becoming a dominant global economic power and reshaped global trade patterns, leading to increased interdependence among nations.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "Describe the significance of the telegraph in transforming the nineteenth-century world.",
      "back": "The telegraph revolutionized communication in the nineteenth century by enabling instant transmission of information over long distances. This had a profound impact on business, military strategy, and news distribution, effectively shrinking the world and facilitating more efficient international trade and diplomacy.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "What was the economic impact of British manufacturers flooding the Indian market with goods in the nineteenth century?",
      "back": "The influx of British manufactured goods into the Indian market led to the decline of local industries, particularly textiles, as they could not compete with the cheaper, mass-produced British goods. This resulted in economic disruption and contributed to India's economic dependency on Britain.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "How did the world economy change during the late nineteenth-century colonial period?",
      "back": "During the late nineteenth-century colonial period, the world economy became more interconnected as European powers expanded their empires. This period saw increased extraction of resources from colonies, the establishment of global trade networks, and the integration of colonies into the global economy, often to the detriment of local economies.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "What were the consequences of agricultural overproduction in the early twentieth century?",
      "back": "Agricultural overproduction in the early twentieth century led to a surplus of goods, causing prices to drop and farmers' incomes to decline. This contributed to rural poverty and was one of the factors that exacerbated the economic difficulties during the Great Depression.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "Discuss the role of railways in the economic development of the nineteenth century.",
      "back": "Railways played a crucial role in the economic development of the nineteenth century by facilitating the efficient movement of goods and people. They reduced transportation costs, opened up new markets, and stimulated industries such as steel and coal, thus contributing significantly to industrialization and economic growth.",
      "subject": "history",
      "difficulty": "intermediate"
    },
    {
      "front": "How did the collapse of major banks and currencies impact the global economy during the Great Depression?",
      "back": "The collapse of major banks and currencies during the Great Depression led to a severe contraction of credit, loss of savings, and a decline in consumer and business confidence. This triggered a global economic downturn, characterized by high unemployment and deflation, which had long-lasting effects on international trade and economic policies.",
      "subject": "history",
      "difficulty": "intermediate"
    }
  ],
  "timestamp": 1750514740682,
  "difficulty": "intermediate",
  "focusAreas": "{\"concepts\":true,\"definitions\":true,\"examples\":true,\"procedures\":true}"
}