{
  "hash": "a7bb291af26c",
  "text": "SECTION II\nLIVELIHOODS, ECONOMIES AND SOCIETIES\nReprint 2025-26\n\n\nReprint 2025-26\n\n\n53\nThe  Making  of  a  Global  World\n1  The Pre-modern World\nWhen we talk of ‘globalisation’ we often refer to an economic\nsystem that has emerged since the last 50 years or so. But as you will\nsee in this chapter, the making of the global world has a long\nhistory – of trade, of migration, of people in search of work, the\nmovement of capital, and much else. As we think about the dramatic\nand visible signs of global interconnectedness in our lives today,\nwe need to understand the phases through which this world in\nwhich we live has emerged.\nAll through history, human societies have become steadily more\ninterlinked. From ancient times, travellers, traders, priests and\npilgrims travelled vast distances for knowledge, opportunity and\nspiritual fulfilment, or to escape persecution. They carried goods,\nmoney, values, skills, ideas, inventions, and even germs and diseases.\nAs early as 3000 BCE an active coasta",
  "subject": "history",
  "flashcards": [
    {
      "front": "What role did the Silk Routes play in pre-modern trade?",
      "back": "The Silk Routes were a network of trade routes that facilitated vibrant pre-modern trade across Asia, connecting the East and West and allowing for the exchange of goods like silk, spices, and pottery, significantly contributing to cultural and economic exchanges.",
      "subject": "history",
      "difficulty": "advanced"
    },
    {
      "front": "How did diseases such as smallpox impact European colonial expansion in the sixteenth century?",
      "back": "During the European colonial expansion in the sixteenth century, diseases like smallpox, to which Europeans had developed immunity, devastated indigenous populations in colonized regions, aiding the colonists in their conquests by significantly reducing native resistance.",
      "subject": "history",
      "difficulty": "advanced"
    },
    {
      "front": "What were the economic changes in the nineteenth century that affected global trade?",
      "back": "The nineteenth century saw profound economic changes, including industrialization, the expansion of the transport network like railways and the telegraph, and the growth of financial centers, which collectively transformed global trade by making it faster and more efficient.",
      "subject": "history",
      "difficulty": "advanced"
    },
    {
      "front": "How did the introduction of new foods like potatoes and pasta influence European diets?",
      "back": "New foods such as potatoes and pasta, introduced to Europe through trade and exploration, significantly influenced European diets by providing new staples that were versatile and nutritious, contributing to population growth and culinary diversity.",
      "subject": "history",
      "difficulty": "advanced"
    },
    {
      "front": "Explain the concept of indentured labor migration in the nineteenth century.",
      "back": "Indentured labor migration in the nineteenth century involved people, particularly from India, entering into labor contracts to work overseas in colonies like Trinidad under harsh conditions, reflecting the dual nature of this era's global economic systems—both exploitative and integrative.",
      "subject": "history",
      "difficulty": "advanced"
    },
    {
      "front": "What were the implications of the 'new system of slavery' in the nineteenth century?",
      "back": "The 'new system of slavery' in the nineteenth century refers to the indentured servitude system, where laborers, mainly from Asia, were contracted to work in plantations under oppressive conditions, drawing parallels to slavery despite being considered 'free' laborers.",
      "subject": "history",
      "difficulty": "advanced"
    },
    {
      "front": "Describe the impact of nineteenth-century colonialism on Africa.",
      "back": "Nineteenth-century colonialism profoundly impacted Africa by disrupting traditional economies and societies, leading to land displacement, the introduction of European goods, and the exploitation of resources, which left lasting economic and social challenges.",
      "subject": "history",
      "difficulty": "advanced"
    },
    {
      "front": "How did advancements in transportation and communication affect the nineteenth-century world economy?",
      "back": "Advancements in transportation, like railways, and communication, such as the telegraph, revolutionized the nineteenth-century world economy by facilitating faster movement and exchange of goods and information, thus enhancing global trade and connectivity.",
      "subject": "history",
      "difficulty": "advanced"
    },
    {
      "front": "What factors contributed to the decline of India's textile industry in the nineteenth century?",
      "back": "The decline of India's textile industry in the nineteenth century was primarily due to British colonial policies that favored British manufactured goods over Indian textiles, leading to a loss of market share and economic decline in the Indian textile sector.",
      "subject": "history",
      "difficulty": "advanced"
    },
    {
      "front": "What role did economic and political factors play in nineteenth-century European colonization?",
      "back": "Economic and political factors drove nineteenth-century European colonization, as countries sought new markets and resources to fuel industrial growth, while political motivations included the desire for national prestige and strategic advantages over rival powers.",
      "subject": "history",
      "difficulty": "advanced"
    }
  ],
  "timestamp": 1750550500476,
  "difficulty": "advanced",
  "focusAreas": "{\"concepts\":true,\"definitions\":true,\"examples\":false,\"procedures\":false}"
}