{
  "hash": "f7bca30a30d6",
  "text": "SECTION II\nLIVELIHOODS, ECONOMIES AND SOCIETIES\nReprint 2025-26\n\n\nReprint 2025-26\n\n\n53\nThe  Making  of  a  Global  World\n1  The Pre-modern World\nWhen we talk of ‘globalisation’ we often refer to an economic\nsystem that has emerged since the last 50 years or so. But as you will\nsee in this chapter, the making of the global world has a long\nhistory – of trade, of migration, of people in search of work, the\nmovement of capital, and much else. As we think about the dramatic\nand visible signs of global interconnectedness in our lives today,\nwe need to understand the phases through which this world in\nwhich we live has emerged.\nAll through history, human societies have become steadily more\ninterlinked. From ancient times, travellers, traders, priests and\npilgrims travelled vast distances for knowledge, opportunity and\nspiritual fulfilment, or to escape persecution. They carried goods,\nmoney, values, skills, ideas, inventions, and even germs and diseases.\nAs early as 3000 BCE an active coasta",
  "subject": "history",
  "flashcards": [
    {
      "front": "What significant change occurred in the pre-modern world during the sixteenth century?",
      "back": "In the sixteenth century, the pre-modern world shrank greatly, leading to increased global interactions and trade.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "What role did the Silk Routes play in pre-modern trade?",
      "back": "The Silk Routes were vibrant trade networks that facilitated the exchange of goods such as Chinese pottery between different regions.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "How did diseases impact European colonization in the sixteenth century?",
      "back": "Diseases like smallpox, to which Europeans were immune, devastated native populations in colonized areas, aiding European conquest.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "What was the impact of population growth in the late eighteenth century on British agriculture?",
      "back": "Population growth increased demand for food, but British agriculture struggled to compete with imports, leading to economic challenges.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "What characterized the nineteenth-century world economy?",
      "back": "The nineteenth-century world economy was marked by increased trade in goods and significant industrial growth, particularly in Britain.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "How did the invention of the telegraph transform the nineteenth-century world?",
      "back": "The telegraph revolutionized communication, enabling faster and more efficient exchange of information globally.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "What was the significance of indentured labor migration from India in the nineteenth century?",
      "back": "Indentured labor migration from India illustrated the dual nature of the nineteenth-century world, with both opportunities and exploitation.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "What challenges did farmers face during the 1930s Depression?",
      "back": "Farmers encountered agricultural overproduction and economic difficulties, leading to widespread financial instability during the Depression.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "What were the effects of colonial rule on India in the nineteenth century?",
      "back": "Colonial rule transformed India into a supplier of raw materials and a market for British manufactured goods, impacting its economy heavily.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "How did the discovery of gold and diamond mining affect South Africa in the nineteenth century?",
      "back": "Gold and diamond mining brought economic prosperity but also social and political challenges, including exploitation and conflict.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "What was the impact of railways on agriculture in the nineteenth century?",
      "back": "Railways facilitated the transportation of agricultural products, boosting trade and contributing to economic development.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "How did European conquests in the nineteenth century affect Africa?",
      "back": "European conquests led to the displacement of African populations, the exploitation of resources, and significant social changes.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "What role did the trade in meat play in the nineteenth-century world economy?",
      "back": "The trade in meat exemplified the interconnectedness of the global economy, with advancements in transport facilitating international trade.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "What characterized the post-war world economy in the twentieth century?",
      "back": "The post-war world economy was marked by industrial growth, stable exchange rates, and low unemployment rates, fostering economic stability.",
      "subject": "history",
      "difficulty": "beginner"
    },
    {
      "front": "How did colonization stimulate investments and improvements in transport in the nineteenth century?",
      "back": "Colonization led to new investments in infrastructure, such as faster railways, to support the increased movement of goods and resources.",
      "subject": "history",
      "difficulty": "beginner"
    }
  ],
  "timestamp": 1750512084923,
  "difficulty": "beginner",
  "focusAreas": "{\"concepts\":true,\"definitions\":true,\"examples\":false,\"procedures\":false}"
}